# GetWarning Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionValidationInfo..::..GetWarning Method
ConnectionValidationInfo Class See Also
---
Access specific warning number of warnings generated by reload.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ConnectionValidationWarning GetWarning(
	int index
)
```

Visual Basic
---
```text
Public Function GetWarning ( _
	index As Integer _
) As ConnectionValidationWarning
```

Visual C++
---
```text
public:
ConnectionValidationWarning^ GetWarning(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Invalid index. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace